depot/app/controllers/orders_controller.rb

SELECT * FROM "orders"
---
  def index
    @orders = Order.all

SELECT * FROM "orders" WHERE ("orders"."id" = 2)
---
  def show
    @order = Order.find(params[:id])