depot/app/controllers/products_controller.rb

  def index
    @products = Product.all(:conditions=>{:locale=>I18n.locale})
---
SELECT * FROM "products"

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("price", "created_at", "title", "image_url", "updated_at", "description") VALUES(0.02, '2010-01-17 11:38:29', 'asadas', '/images/svn.jpg', '2010-01-17 11:38:29', 'price_must_be_at_least_a_cent')

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)
UPDATE "products" SET "updated_at" = '2010-01-17 00:39:06', "price" = 23.0 WHERE "id" = 1