depot/app/controllers/store_controller.rb

INSERT INTO "line_items" ("created_at", "product_id", "quantity", "order_id", "total_price", "updated_at") VALUES('2010-01-24 23:16:24', 4, 1, 1, 29.95, '2010-01-24 23:16:24')
INSERT INTO "orders" ("name", "address", "created_at", "updated_at", "pay_type", "email") VALUES('sdasd', 'ssss', '2010-01-24 23:16:24', '2010-01-24 23:16:24', 'cc', 'xaxaupua@gmail.com')
---
  def save_order
    @order=Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save