depot/app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order=>:name)
---
SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password") VALUES('jgw', '-6114365280.294762797450863', '2010-01-25 23:27:36', '2010-01-25 23:27:36', '06928fe0148c3221a8be6a8d73ea9dca26ca2de9')

  def destroy
    @user = User.find(params[:id])

    begin
      @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "users" WHERE "id" = 1